const news = [
  {
    id: '46734',
  title: '我校召开新冠肺炎防控工作推进会议',
  poster: 'http://www.hevttc.edu.cn/__local/9/24/6B/1C7F4213525AFD45DB7C004508D_A6A6B2F4_19557.jpg',
  add_date: '2020-02-15',
  content: '  2020年2月12日上午，我校在秦皇岛校区学术交流中心召开新冠肺炎防控工作推进会议。学校疫情防控工作领导小组组长、党委书记任民，疫情防控应急处置小组组长、副校长张福喜、蒋爱林及小组成员参加了会议。会议由副校长杨越冬主持。任民指出，新冠肺炎疫情发生以来，全校各级党组织和相关单位不折不扣贯彻落实习近平总书记重要指示精神和上级决策部署，建立疫情防控工作责任制，全面深入摸排湖北籍学生、进出湖北人员、离秦教职工底数，制定了疫情防控预案和方案，加强值班值守，防控工作有力有效。任民表示，当前我校疫情防控工作平稳有序，但仍存在着对疫情防控工作认识不够到位、相关防控举措针对性和操作性不够强、防疫物资缺口较大等问题。' },
{
    id: '54673',
  title: '市委书记朱政学到我校调研指导疫情防控工作',
  poster: 'http://www.hevttc.edu.cn/__local/6/A6/94/1723CBD6FF1AD4099A808A3D0CC_4FDFFF58_16A88.jpg',
  add_date: '2020-02-05',
  content: '  2月4日下午，秦皇岛市委书记朱政学在相关部门领导陪同下，到我校调研检查新型冠状病毒疫情防控工作。校党委书记任民，副校长杨越冬、蒋爱林等领导一同参加检查指导工作。' },
{
    id: '56534',
  title: '我校召开新型冠状病毒疫情应急处置小组会议',
  poster: 'http://www.hevttc.edu.cn/__local/D/ED/6C/01AF127CB606B3EF35342AB4FBC_4EDB30EE_13072.jpg',
  add_date: '2020-01-15',
  content: '   1月28日，我校党委书记任民主持召开新型冠状病毒疫情应急处置小组会议，深入学习贯彻习近平总书记在中共中央政治局常务委员会会议上的重要讲话精神和省委书记王东峰、省长许勤对全省新型冠状病毒感染的肺炎疫情防控工作的讲话精神，进一步研究部署我校新型冠状病毒感染的肺炎疫情防控工作。学校应急处置小组组长、副校长张福喜、蒋爱林及小组成员参加了会议。'
},     
{
    id: '56734',
  title: '我校召开“不忘初心、牢记使命”主题教育总结大会',
  poster: 'http://www.hevttc.edu.cn/__local/5/0B/4D/236D7159DC6ABAED3A1145B87F5_A0DCFE7A_1531B.jpg',
  add_date: '2020-01-15',
  content: '    2020年1月13日下午，我校召开“不忘初心、牢记使命”主题教育总结大会，对学校主题教育开展情况进行总结，对巩固深化主题教育成果进行安排部署。省委第二批主题教育第十巡回指导组组长李相佑同志、指导组成员边杰、杜鹏同志出席会议。学校领导班子成员，主题教育领导小组成员、领导小组办公室成员，各基层党委（党总支）书记、职能部门教辅单位负责人、教学单位行政负责人参加了会议。'
  },
  {
    id: '54674',
  title: '我校召开校领导班子“不忘初心、牢记使命”专题民主生活会',
  poster: 'http://www.hevttc.edu.cn/__local/7/70/16/5CE5954177E195BF0E9DA650ECE_9BC5513D_154AE.jpg',
  add_date: '2019-12-06',
  content: '    12月4日上午，校领导班子“不忘初心、牢记使命”专题民主生活会在秦皇岛校区召开。省委第十巡回指导组组长李相佑，成员边杰、杜鹏出席会议。校党委书记任民主持会议，校党委领导班子成员郭鸿湧、兰耀东、李佩国、张福喜、孙雪莲、冯瑞银、蒋爱林参加会议，副校长杨越冬、学校有关职能部门负责同志、党员代表、学校主题教育领导小组办公室成员列席会议。'
  },
  {
    id: '54634',
  title: '教育部副部长孙尧赴青龙调研定点扶贫工作',
  poster: 'http://www.hevttc.edu.cn/__local/7/A5/D0/C1731C073601CD27769E2DD33C1_8F7EF5BE_11D9E.jpg',
  add_date: '2019-11-20',
  content: '    为进一步推进教育部定点扶贫工作，2019年11月14日，教育部党组成员、副部长孙尧赴青龙县进行调研。教育部职成司司长陈子季、国家开放大学党委书记荆德刚、河北省教育厅副厅长贾海明、秦皇岛市副市长廉茹艳、青龙县县长王殿忠等陪同调研。我校党委副书记、校长郭鸿湧，副校长杨越冬，以及板栗产业团队齐永顺教授、中药材产业团队乔亚科教授等参加调研活动。'
  },
  {
    id: '23875',
  title: '校领导出席校企合作签约活动',
  poster: 'http://www.hevttc.edu.cn/__local/6/B3/97/DD5532419832730489319275A70_9F5FF40D_25899.jpg',
  add_date: '2019-11-18',
  content: '    2019年11月13日，我校与贵州茅台酒厂（集团）昌黎葡萄酒业有限公司战略合作签约活动在秦皇岛市昌黎县葡萄小镇举行。校党委副书记、校长郭鸿湧，校党委常委、副校长冯瑞银，昌黎县委常委、常务副县长张贵田，贵州茅台酒厂（集团）昌黎葡萄酒业有限公司董事长司徒军、副总经理范雪梅，秦皇岛食品药品检验中心主任张克义等共同出席活动。我校食品科技学院、教务处、科研处负责同志参加签约活动。'
  },
  {
    id: '54634',
  title: '教育部副部长孙尧赴青龙调研定点扶贫工作',
  poster: 'http://www.hevttc.edu.cn/__local/7/A5/D0/C1731C073601CD27769E2DD33C1_8F7EF5BE_11D9E.jpg',
  add_date: '2019-11-20',
  content: '    为进一步推进教育部定点扶贫工作，2019年11月14日，教育部党组成员、副部长孙尧赴青龙县进行调研。教育部职成司司长陈子季、国家开放大学党委书记荆德刚、河北省教育厅副厅长贾海明、秦皇岛市副市长廉茹艳、青龙县县长王殿忠等陪同调研。我校党委副书记、校长郭鸿湧，副校长杨越冬，以及板栗产业团队齐永顺教授、中药材产业团队乔亚科教授等参加调研活动。'
  },
  {
    id: '23875',
  title: '校领导出席校企合作签约活动',
  poster: 'http://www.hevttc.edu.cn/__local/6/B3/97/DD5532419832730489319275A70_9F5FF40D_25899.jpg',
  add_date: '2019-11-18',
  content: '    2019年11月13日，我校与贵州茅台酒厂（集团）昌黎葡萄酒业有限公司战略合作签约活动在秦皇岛市昌黎县葡萄小镇举行。校党委副书记、校长郭鸿湧，校党委常委、副校长冯瑞银，昌黎县委常委、常务副县长张贵田，贵州茅台酒厂（集团）昌黎葡萄酒业有限公司董事长司徒军、副总经理范雪梅，秦皇岛食品药品检验中心主任张克义等共同出席活动。我校食品科技学院、教务处、科研处负责同志参加签约活动。'
  },
  {
    id: '54634',
  title: '教育部副部长孙尧赴青龙调研定点扶贫工作',
  poster: 'http://www.hevttc.edu.cn/__local/7/A5/D0/C1731C073601CD27769E2DD33C1_8F7EF5BE_11D9E.jpg',
  add_date: '2019-11-20',
  content: '    为进一步推进教育部定点扶贫工作，2019年11月14日，教育部党组成员、副部长孙尧赴青龙县进行调研。教育部职成司司长陈子季、国家开放大学党委书记荆德刚、河北省教育厅副厅长贾海明、秦皇岛市副市长廉茹艳、青龙县县长王殿忠等陪同调研。我校党委副书记、校长郭鸿湧，副校长杨越冬，以及板栗产业团队齐永顺教授、中药材产业团队乔亚科教授等参加调研活动。'
  },
  {
    id: '23875',
  title: '校领导出席校企合作签约活动',
  poster: 'http://www.hevttc.edu.cn/__local/6/B3/97/DD5532419832730489319275A70_9F5FF40D_25899.jpg',
  add_date: '2019-11-18',
  content: '    2019年11月13日，我校与贵州茅台酒厂（集团）昌黎葡萄酒业有限公司战略合作签约活动在秦皇岛市昌黎县葡萄小镇举行。校党委副书记、校长郭鸿湧，校党委常委、副校长冯瑞银，昌黎县委常委、常务副县长张贵田，贵州茅台酒厂（集团）昌黎葡萄酒业有限公司董事长司徒军、副总经理范雪梅，秦皇岛食品药品检验中心主任张克义等共同出席活动。我校食品科技学院、教务处、科研处负责同志参加签约活动。'
  }
]

//获取新闻列表
function getNewList()
{
  let list = [];
  for( var i = 0; i < news.length; i++){
    let obj = {};
    obj.id = news[i].id;
    obj.poster = news[i].poster;
    obj.content = news[i].content;
    obj.add_date = news[i].add_date;
    obj.title = news[i].title;
    list.push(obj);
  }
  return list;
}

//获取新闻内容
function getNewsDetail(newsID)
{
  let message = {
    code:'404',
    news:{}
  };
  for( var i = 0; i < news.length; i++){
    if( newsID == news[i].id ){
      message.code = '200',
      message.news = news[i];
      break;
    }
  }
  return message;
}

module.exports = {
  getNewList:getNewList,
  getNewsDetail:getNewsDetail
}